/*------------------------------------------------------------------------
--                                                                      --
--             H E L I O S   U N I X  L I N K  I / O   S Y S T E M      --
--             ---------------------------------------------------      --
--                                                                      --
--             Copyright (C) 1993, Perihelion Software Ltd.             --
--                        All Rights Reserved.                          --
--                                                                      --
--      parsy.c                                                         --
--                                                                      --
------------------------------------------------------------------------*/
/* RcsId: $Id: par_link.c,v 1.1 1993/09/28 14:24:17 bart Exp $ */
/* Copyright (C) 1989, Perihelion Software Ltd.        			*/

/**
*** THIS CODE IS NOT PART OF THE STANDARD SOURCE RELEASE. IT SHOULD BE
*** USED ONLY IN-HOUSE AND FOR ANY PARSYTEC SOURCE RELEASES.
**/

/*
 * linkp.c	General interface to transputer hardware
 *
 * Copyright (C) Parsytec GmbH, 1989.
 * Copyright (C) CWA mbH, 1991 (for all parts concerning SBUS/BBK-S4).
 *
 * Author:	Matthias Clauss
 *		Design assistents by Armin Joachimsmeyer
 *
 *		Michael Raus (all parts concerning SBUS/BBK-S4)
 *
 *
 * Date:	9.6.1989	Created
 *
 * Version:	1.30
 *
 * Updates:
 *	Vers	date	author	description

 *	int   GetPacket   (char *Buffer);
 *	int   PutPackets  (struct packet *Packets, u_char Count);
 *	struct packetInfo *InfoPacket ();
 *  === Internal usage only, please! (s4diag)
 *	word TestFirmwareCode ();
 */



/* The following variables are defined in additional file 'lconf.c'
 * and are declared here as external references.
 * This has been done in order to let the installing administrator
 * chose suitable defaults for all these variables.
 * The only realy interresting variables are:
 *
 *	vme_dev_name		default:   "/dev/vme32d16"
 *	config_file		default:   "/usr/etc/transp/trans_conf"
 *
 * BLV - for the I/O Server these variables are defined in parsy/parsy.c,
 * not in lconf.c
 */

extern char *config_file;
extern char *env_config;
extern char *vme_group_name;
extern char *vme_dev_name;
extern char *sbus_dev_name;
extern key_t sem_link_key;	/* semaphore transputer key */
extern int   default_tenth;	/* default 0.1s loop count */
extern unsigned reset_raise;	/* reset raise time in usec */
extern unsigned reset_fall;	/* reset fall  time in usec */


static int sem_id     = -1;	/* semaphore identifier for transputer links */
static int vme_device = -1;	/* file descriptor for VME-bus device */
static int usr_gid    = -1;	/* real gid */
static int vme_gid    = -1;	/* saved effective gid to access VME-bus */
static int MaxLinkId  = -1;	/* total number of links declared
				 * Valid LinkIds are:
				 * 0 <= LinkId < MaxLinkId
				 */
static int time_tenth = -1;	/* # loops for 1/10 th second
				 * this is the default value. 'init_timeout()'
				 * measures correctly using 'itimer(2)'
				 */
static int time_max   = -1;	/* maximum timeout time in 1/10 th second.
				 * Longer timeout cannot be expressed
				 * on this machine within a 'int'. Otherwise
				 * integer arithmetics overflow will occur.
				 * Set by 'init_timeout()'.
				 */


/* symbolic bus types	*/

#define	VMEBUS	((short)0)	/* VMEBUS device */
#define SBUS	((short)1)	/* SBus device */


#define	SBUSMASK      ((word)0xAA00) /* Mask definitions */
#define RESET         ((word)0x1111)
#define INIT_STREAM   ((word)0x2222)
#define INIT_PACKET   ((word)0x3333)
#define TIMEOUT_READ  ((word)0x4444)
#define TIMEOUT_WRITE ((word)0x5555)
#define VERSION	      ((word)0x6666)

#define	SBUS_MIN_TIMEOUT  3	/*minimum SBus timeout in tenth of seconds*/ 

#ifdef	IPX
#define	STIME_SCALE	  7	/* BBK-S4 timeout is this factor longer */
#else
#define	STIME_SCALE	  2	/* BBK-S4 timeout is this factor longer */
#endif

#define	MAX_SBUS_SLOTS	  4	/* the maximum number of supported 
				 * SBus slots
				 */

#define RESET_TIME   0x1000	/* time for reset link signal active 
              			 * in 1/16 milli second (swapped !!!)
				 */
/* byte is defined in 'link.h' */

typedef unsigned short    word;
typedef unsigned int      lword;

/* describtion of a (ambigious) link adaptor.
 * A value of ANY means "not specified".
 * {VMTM, ANY, 0} means any VMTM board link 0
 * {ANY, ANY, ANY}  means any link on any board
 */

static struct LinkDesc {
	short	b_type;		/* short coded board type */
	short	b_no;		/* board number */
	short	b_slot;		/* SBus slot number */
	short	l_no;		/* link number on board */
	short	bus_type;	/* bus type */
};

/*
 * LinkInfo structure. Similar to FILE structure in <stdio.h>
 */

static struct LinkInfo {
	short	opened;		/* TRUE if successfull opened */
	short	packetlink;	/* TRUE if used as PacketLink */
	caddr_t	usr_ad;		/* ready to use ptr to link hardw. */
	struct LinkDesc ldes;	/* link descriptor */
	caddr_t vme_addr;	/* vme/SBus address of this link */
};

#define	B_type		ldes.b_type
#define	B_no		ldes.b_no
#define	B_slot		ldes.b_slot
#define	L_no		ldes.l_no
#define Bus_type	ldes.bus_type

static struct LinkInfo	*LinkInfo;	/* array of LinkInfo structs
					 * Initialized by init_config()
					 */
/* 
 * FlagAdr structure
 *
 * One of these FlagAdr structures belongs to each available link. The number
 * of available links (MaxId) depends on the contents of the 'trans_conf' file.
 * The FlagAdr structures are initialized by init_config() and each of them 
 * is filled with the correct values as soon as its OpenLink occurs.
 */

static	struct	FlagAdr {
	short	 half_chan_len;		/* half channel length */
	word	 *read_link_rq0;	/* ptr to readlink request flag 0 */
	word	 *read_link_rq1;	/* ptr to readlink request flag 1 */
	word 	 *blockin_ack;		/* ptr to blockin acknow. flag */
	word	 *chan_free;		/* ptr to channel free flag */
	word	 *write_link_rq0;	/* ptr to writelink request flag 0 */
	word	 *write_link_rq1;	/* ptr to writelink request flag 1 */
	word 	 *blockout_ack;		/* ptr to blockout acknow. flag */
	word	 *event_ack;		/* ptr to event acknowledge flag */
	word	 *init_event;		/* ptr to event initialisation */
	word	 *test_read;		/* ptr to test read flag */
	word	 *test_write;		/* ptr to test write flag */
	word	 *read_timeout;		/* ptr to read timeout flag */
	word	 *write_timeout;	/* ptr to write timeout flag */
};

static struct FlagAdr	*FlagAdr;	/* array of FlagAdr structs
					 * Initialized by init_config()
					 */

/*
 * Dual Ported RAM structure (BBK-S4 only)
 * Note: The BBK-S4 has a T222 in the beginning and is sold since 5.92
 *	 with an T225. This has NO impact on this code.
 */

static struct DpR {
	short	channel_off;	/* channel functional page offset */
	short	regs_off;	/* register functional page offset */
	short	com_off;	/* T222 <-> SBus communication register */
	short	channel_len;	/* standard channel length */
	short	regs_len;	/* link register length */
	short	int_s_t2_off;	/* interrupt register offset SBus -> T222 */
	short	int_t2_s_off;	/* interrupt register offset T222 -> SBus */ 
};


/*
 * SBusSlot structure.
 */

static struct SBusSlot {
	int	device;		/* file descriptor for SBus device in this
				 * SBus slot
				 */
	short 	mmap;		/* mmap=1 if memory mapping yet established
				 * for SBus device in this SBus slot
				 */
	unsigned space;		/* address space used by the SBus device
				 * in this SBus slot
				 */
	long	base;		/* SBus slot base address */
	struct DpR  dpr;	/* Dual ported RAM offsets and parameter */
};


/* array of SBusSlot structs. Initialized by init_config() */

static struct SBusSlot *SBusSlot;

/* symbolic board types */

#define	BBKV1	((short)0)	/* BBK-V1 only link adaptor */
#define	BBKV2	((short)1)	/* BBK-V2 1 transputer 2 Mb */
#define	VMTM	((short)2)	/* VMTM 4 transputer, link switch */
#define	BBKV4	((short)3)	/* BBK-V4 4 link-adaptors only */
#define	MTMSUN1	((short)4)	/* MTM-SUN 1 ncu 1-8 transputers */
#define	MTMSUN2	((short)5)	/* MTM-SUN 2 ncu 1-8 transputers */
#define	BBKS4	((short)6)	/* BBK-S4 SBus link adaptor */
#define	LINK	((short)7)	/* Dummy to specifiy a link by its index */


/*
 * here is an array which gives the usual names for
 * each board type.
 * The current maximum size is  8 characters.
 * The position corresponds to the value of symbolic board-names
 * (in file "vmeboard.h" e.g. VMTM).
 */
 
static char *(std_b_name []) = {
	"bbk-v1",
	"bbk-v2",
	"vmtm",
	"bbk-v4",
	"mtm-sun1",
	"mtm-sun2",
	"bbk-s4",
	"--LINK--"
};



/* VME bus/SBus transputer module descriptor.
 * Describes the name (as string) and the type and number
 * of link adaptors on this board.
 * For greater flexibility allow several names for the same board.
 */

#define	MAX_BOARD_LINKS	  9	/* the maximum number of links per board */

static struct board_descr {
	char *name;	/* board name as string */
	short type;	/* board name coded as int */
	short links;	/* number of link adaptors */
	short size[MAX_BOARD_LINKS];
			/* offset of i-th link from board base.
			 * Unfortunatly the VMTM uses {0x10, 0x20, 0x40, 0x80}
			 */
};

/* =======			W A R N I N G 
 * =======
 * =======	At the moment there is no check for consistency
 * =======	in the initialised values between 'links' and
 * =======	the constant 'MAX_BOARD_LINKS'.
 * =======	You are responsible to ensure that :
 * =======		every value 'links' < MAX_BOARD_LINKS
 */

static struct board_descr b_names[] = {
/*   name     type   links   offsets for each link on this board */

{ "bbkv1",   BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "bbk-v1",  BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "bbk_v1",  BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBKV1",   BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBK-V1",  BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBK_V1",  BBKV1,  1, {0x100, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "bbkv2",   BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "bbk-v2",  BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "bbk_v2",  BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBKV2",   BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBK-V2",  BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "BBK_V2",  BBKV2,  1, {0, 0, 0, 0, 0, 0, 0, 0, 0} },
{ "vmtm",    VMTM,   4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "VMTM",    VMTM,   4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "bbkv4",   BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "bbk-v4",  BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "bbk_v4",  BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "BBKV4",   BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "BBK-V4",  BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "BBK_V4",  BBKV4,  4, {0x10, 0x20, 0x40, 0x80, 0, 0, 0, 0, 0} },
{ "mtmsun1", MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "mtm-sun1",MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "mtm_sun1",MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "MTMSUN1", MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "MTM-SUN1",MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "MTM_SUN1",MTMSUN1,5, {0x80, 0x90, 0xA0, 0xB0, 0x100, 0, 0, 0, 0}},
{ "mtmsun2", MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "mtm-sun2",MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "mtm_sun2",MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "MTMSUN2", MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "MTM-SUN2",MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "MTM_SUN2",MTMSUN2,9, {0x80, 0x90, 0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0,0x100}},
{ "bbks4",   BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{ "bbk-s4",  BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{ "bbk_s4",  BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{ "BBKS4",   BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{ "BBK-S4",  BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{ "BBK_S4",  BBKS4,  4, {0x100,0x480,0x800,0xB80, 0, 0, 0, 0, 0}},
{   NULL,    0,      0, {0, 0, 0, 0, 0, 0, 0, 0, 0} }
};
			
/*
 *	here the declarations for the hardware layout
 *	of the transputer modules.
 *	Currently supported:
 *		BBK-V1
 *		BBK-V2
 *		VMTM
 *		BBKV4		(VMTM board without transputers)
 *		MTM-SUN1	(only onboard ncu)
 *		MTM-SUN2	(additional ncu, total 2 ncu's)
 *		BBK-S4		(SBus board without transputers)
 *
 */



/* SBus descriptor.
 * Describes name (as string) and type of this board and the
 * number of supported SBus slots with their physical addresses
 * For greater flexibility allow several names for the same board.
 */


static struct sbus_descr {
	char	*name;		/* board name as string */
	short 	type;		/* board name coded as int */
	short 	slots;		/* number of SBus slots */
	int   	mem;		/* used address space */
	long	slot_base[MAX_SBUS_SLOTS];	/* physical SBus addresses */
	struct DpR   dpr;	/* Dual ported RAM offsets and parameter */
};

/* =======			W A R N I N G 
 * =======
 * =======	At the moment there is no check for consistency
 * =======	in the initialised values between 'slots' and
 * =======	the constant 'MAX_SBUS_SLOTS'.
 * =======	You are responsible to ensure that :
 * =======		every value 'slots' < MAX_SBUS_SLOTS
 */

static struct sbus_descr s_names[] = {
/* name     type slots mem    physical address for each SBus slot 
 *  offsets: channels  regs  comm.   channel length  regs length inter.offsets
 */

{ "bbks4",  BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},
	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{ "bbk-s4", BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},	
	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{ "bbk_s4", BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},
 	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{ "BBKS4",  BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},
	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{ "BBK-S4", BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},
	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{ "BBK_S4", BBKS4, 4, 0x6000, {0xF8000000, 0xFA000000, 0xFC000000, 0xFE000000},
	      0x4100, 0x5F00, 0x5F80, 0x380,  0x20, 0x5FFC, 0x5FFE },
{   NULL,    0,    0, 0,      {0, 0, 0, 0}, 0, 0, 0, 0, 0, 0, 0 }
};


#define READYMASK   0x01	/* for instatus and outstatus */




static struct slink_1 {		/* BBK-V1 */
	byte dummy0;		/* link adaptor at 0x100 */
	byte indata;	 /* 0x101 */
	byte dummy1;
	byte outdata;	 /* 0x103 */
	byte dummy2;
	byte instatus;	 /* 0x105 */	/* also stopreset */
	byte dummy3;
	byte outstatus;	 /* 0x107 */
	byte dummy4[0x81-0x7-1];
	byte startreset; /* 0x181 */
};

static struct slink_2 {		/* BBK-V2 */
	byte dummy0;
	byte indata;	 /* 0x1 */
	byte dummy1;
	byte outdata;	 /* 0x3 */
	byte dummy2;
	byte instatus;	 /* 0x5 */
	byte dummy3;
	byte outstatus;	 /* 0x7 */
	byte dummy4[3];
	byte startreset; /* 0xB */
	byte dummy5[3];
	byte stopreset;	 /* 0xF */
};

static struct slink_v {		/* VMTM */
	byte dummy0;
	byte indata;	 /* 0x1 */
	byte dummy1;
	byte outdata;	 /* 0x3 */
	byte dummy2;
	byte instatus;	 /* 0x5 */
	byte dummy3;
	byte outstatus;	 /* 0x7 */
	byte dummy4[5];
	byte startreset; /* 0xD */	/* should  N O T  be read */
	byte dummy5;
	byte stopreset;	 /* 0xF */	/* should  N O T  be read */
};

static struct slink_4 {		/* BBK-V4 */
	byte dummy0;
	byte indata;	 /* 0x1 */
	byte dummy1;
	byte outdata;	 /* 0x3 */
	byte dummy2;
	byte instatus;	 /* 0x5 */
	byte dummy3;
	byte outstatus;	 /* 0x7 */
	byte dummy4[5];
	byte startreset; /* 0xD */	/* should  N O T  be read */
	byte dummy5;
	byte stopreset;	 /* 0xF */	/* should  N O T  be read */
};

static struct slink_m {		/* MTM-SUN */
	byte indata;	 /* 0x0 */
	byte dummy0;
	byte outdata;	 /* 0x2 */
	byte dummy1;
	byte instatus;	 /* 0x4 */
	byte dummy2;
	byte outstatus;	 /* 0x6 */
	byte dummy3;
			  /* the following registers are WRITE ONLY */
	byte startresetLine;  /* 0x8 */	/* set reset link line      */
	byte startresetAdapt; /* 0x9 */	/* set reset link adaptor   */
	byte dummy4[2];
	byte stopresetLine;   /* 0xC */	/* clear reset link line    */
	byte stopresetAdapt;  /* 0xD */	/* clear reset link adaptor */
};

/* There are more advanced features on the MTM-SUN board.
 * At adr range 0x00 .. 0x7F every byte contains the same
 * instatus summary for the first 8 link adaptors. Adaptor-
 * number and bit-number correspond.
 * At adr range 0x180 .. 0x200 every byte contains the same
 * outstatus summary for the first 8 link adaptors. Adaptor-
 * number and bit-number correspond.
 * Link adaptor 8 (the ninth adaptor) is connected to the ncu
 * section on the board and should not be used by users.
 * The dual-ported DRAM section is sized 4 Mb and starts at
 * adr offset 0x1000.
 */ 


static struct slink_s {		/* BBK-S4 */ /* communication buffer
					      * T222 <-> SBus at 0xF80
					      */
 	word 	startreset[4];	/* 0xF80 */ /* start reset link line */
	word 	stopreset[4];	/* 0xF88 */ /* stop reset link line */
	word 	linkalive[4];	/* 0xF90 */ /* link alive register */
	word	resetwait[4];	/* 0xF98 */ /* reset halt flag */
	word	event_ack_sbus;	/* 0xFA0 */ /* event acknowledge to SBus flag */
};

static struct BBKS4_regs {	/* BBK-S4 */ /* read/write register */
	word	testread;	/* 0x00 */ /* test read flag */
	word	readlinkrq[2]; 	/* 0x02 */ /* [0]: ReadLink request */
				/* 0x04 */ /* [1]: number of bytes to read */
	word	blockinack;	/* 0x06 */ /* BlockIn acknowledge */
	word	channelfree;	/* 0x08 */ /* channel free flag */
	word	readtimeout;	/* 0x0A */ /* ReadLink timeout*/
	word	dummy1[2];
	word	testwrite;	/* 0x10 */ /* test write flag */
	word	writelinkrq[2];	/* 0x12 */ /* [0]: WriteLink request */
				/* 0x14 */ /* [1]: number of bytes to write */
	word	blockoutack;	/* 0x16 */ /* BlockOut acknowledge */
	word	writetimeout;	/* 0x18 */ /* WriteLink timeout */
};	


/*
 *	GetPacket(), PutPackets() definitions and variables
 *
 *	version from 26-01-92, 22.00 
 */

#define	NO_OF_DPR_WRITE_BUFS	2
#define	NO_OF_DPR_READ_BUFS	2
#define	DPR_BUF_LEN		0x80	/* buffer length: 128 byte */
#define PACKET_DATA_LEN		0x7C 	/* packet data length: 124 byte */
#define	PACKET_BODY_LEN		0x78	/* packet body length: 120 byte */
#define TOT_HEADER_LEN		0x5	/* total header length: 5 byte */
#define	MAX_REQS		0x7F	/* maximum number of packets to put */
#define	SIZE_OF_LONG		4
#define	LEN_PRXHDR		1	/* parix header length: 1 long word
					 *		          (4 byte)
					 */
/*
 *	Link modes for BBK-S4 only
 */

#define	PACKETMODE		0x0100
#define	STREAMMODE		0x0200
#define	INFOPACKETMODE		0x0300
#define	INITIALIZESTREAMMODE	0x0400
#define	INITIALIZEPACKETMODE	0x0500

/*
 * 	Global variables
 */

static	long	*Memory_write_address[NO_OF_DPR_WRITE_BUFS]; 
					/* virtual address to write to */

